[
  {
    "path": "posts/2021-02-25-proposal/",
    "title": "Project Proposal",
    "description": "Prime Mover (PM) Waiting Time in Yard",
    "author": [
      {
        "name": "Li Zheng Long, Lim Kai Chin",
        "url": "https://kaichinlim.netlify.app/"
      }
    ],
    "date": "2021-02-25",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nProject Motivation\r\nReview of Existing Work\r\nProposed Scope and Methodology\r\nStoryboard and Visualisation Features\r\nData Source\r\nApplication Libraries & Packages\r\nTask Breakdown\r\nReferences\r\n\r\nIntroduction\r\nMaritime trade has been the backbone of international trade as they account for approximately 92% of world trade.1 PSA Singapore handles about a fifth of the world’s transhipped containers as the world’s busiest transhipment port.2 For more than four decades, PSA continuously developed and upgraded its container handling infrastructure, pioneered new systems and processes, and streamlined operations to meet the rapid growth in its container terminal business as part of the strive for operational excellence.3\r\nUpon a vessel’s arrival at a berth in the container terminal, containers are discharged from and loaded onto it. A typical discharging operation starts with a quay crane picking up a container from the vessel and placing it onto a PM, which will then transport to a storage yard. At the yard, a yard crane picks up the container from the PM and shifts it to a designated spot. Loading operations involve the transporting of containers in the opposite direction, from the yard to the vessel.4\r\nTherefore, PM productivity is of key interest to PSA as it is the main driver for the time taken to load and unload vessels. PM Productivity is defined as the sum of the total number of containers handled divided by the total hours. The following are the key terms which PSA uses to define PM productivity.\r\n\\[ Productivity = Total Containers Handled / Total Time \\] \\[Total Time = Sum (Est. Travel Time + Est. Wait Time + Non Work Time)\\]\r\nTotal Time is defined as the time difference between the two operation activities.\r\nEstimated Travel Time is the duration between two locations based on distance matrix with fixed speed limit/hr.\r\nNon-Work Time is the time taken for a change of driver, meal break, and PM breakdown (if any).\r\nEstimated Wait Time = Total Time – Non-Work Time – Est. Travel Time\r\nProject Motivation\r\nThe study objective is to seek insight from Prime Mover (PM) Operations records to identify common characteristics exhibited by PM with high and low waiting times, through understanding of PM events and operational data. This, in turn, enables us to pinpoint and identify correlated attributes and embark on further study to improve the overall productivity of PM operations and resource utilisation through active targeting of activities contributing to the PM waiting time.\r\nReview of Existing Work\r\nCurrent operation performances are tracked using Operation Indicators such as PM productivity and PM waiting time aggregated by duration, from shifts to monthly reports and breakdown by individual terminal and PM.\r\nPrevious studies on PM operation efficiency typically focus on crane productivity by work schedule5 , and resource planning & deployment to find the optimal number of PMs and trucks (haulier) to reduce average PM waiting time.6\r\nProposed Scope and Methodology\r\nThis study seeks to create an R Shiny app that allows for users to input parameters to suit their needs.\r\nInteractive dashboard that allows for Operations Managers to understand\r\nSummary statistics for PM events\r\nHistograms for wait time with parameters for each type of container\r\nTime series (across hours) for wait times with variable parameters\r\n\r\nAverage PM wait time by cntr length by time of day \r\nAverage PM wait time by equipment type by time of day \r\nTree maps for container types and movements \r\nBar charts of container types \r\nScatter Plots (Total duration of entry vs waiting time)\r\n\r\nPerformance of Terminals\r\nHistograms for wait time with parameters for each type of container \r\n\r\nPerformance of type of containers (Dangerous Goods, Reefer, General Purpose) & size of containers (20-footer, 40-footer, Oversized)\r\nPerformance of type of equipment (Quay crane, various types of Yard Cranes)\r\n\r\nConfirmatory data analysis\r\nUncertainty analysis through calculation of median and confidence intervals of time spent based on types and sizes of containers, different terminals, Equipment type, Day/night shifts, different yard activities.\r\n\r\n\r\nDistribution comparisons between categories of containers(e.g. using box plots, violin plots)\r\nMultivariate analysis using cross tabs\r\nParallel coordinates analysis\r\n\r\nStoryboard and Visualisation Features\r\nThe Shiny app will be designed in this manner:\r\nIntroduction: To give context and background for the project \r\nEDA - Time Series: To visualise the activities that are carried out across time periods \r\nEDA - Treemaps: To visualise the proportion of different types of parameters (container type, equipment type) \r\nEDA - Bar Charts: To visualise the counts and activities happening in a day \r\nEDA - Histogram: To visualise the distribution of waiting times and driving times of the activities \r\nCDA - ANOVA: To test for different variances and distributions\r\nCDA - Parallel Coordinates: To visualise different patterns in the data \r\nCDA - Violin / Box Plots: To visualise the confidence intervals \r\nAbout: To provide definitions and FAQs\r\nData Source\r\nThe data source used is provided by PSA Singapore’s PM OPS anonymised dataset that contains PM operation event records in a generic 12 hr shift. There are approximately 65,000 records with 69 variables. The dataset is reduced to the following 17 variables for the analysis:\r\nS/N\r\nVariable Name\r\nDescription\r\n1\r\n[SHIFT_D]\r\nDate of shift\r\n2\r\n[TERMINAL_ID]\r\nContainer Terminal ID\r\n3\r\n[EVENT_C]\r\nEQOF = Equipment Offload from PM to Yard Crane EQMT = Equipment Mount to PM from Yard Crane\r\n4\r\n[EVENT_DT]\r\nEvent Datetime\r\n5\r\n[EVENT_SHIFT_I]\r\nShift indicator D =Day N = Night\r\n6\r\n[MOVE_OP_C]\r\nMove Operation Code\r\n7\r\n[LENGTH_Q]\r\nContainer Length e.g 20 40 45 ft\r\n8\r\n[CNTR_TYPE_C]\r\nContainer Type RF = Reefer GP = General Purpose DG = Dangerous Goods OH = Over height Container UC = UnContainerized\r\n\r\n\r\n\r\n9\r\n[CNTR_ST_C]\r\nContainer Status E = Empty , F = Full\r\n10\r\n[DG_I]\r\nDangerous Good Indicator\r\n11\r\n[REEFER_I]\r\nReefer Indicator\r\n12\r\n[UC_I]\r\nUncontainerized Indicator\r\n13\r\n[OVER_SIZE_I]\r\nOver Size Container Indicator\r\n\r\n\r\n\r\n14\r\n[EQUIPMENT_TYPE_C]\r\nEquipment Type Code (Quay Crane and Type of Yard Cranes)\r\n15\r\n[PM_DISTANCE_Q]\r\nDistance travelled from previous location\r\n16\r\n[PM_TRAVEL_TIME_Q]\r\nTravel Time\r\n17\r\n[PM_WAIT_TIME_Q]\r\nWait Time\r\nApplication Libraries & Packages\r\nR Shiny\r\nggplot\r\ntidyverse\r\nRMarkdown\r\ndplyr\r\nggstatsplot\r\ninfer\r\nTask Breakdown\r\nThe areas of responsibility are foreseen to be as follows.\r\nTasks\r\nTeam Members Responsible\r\nIntroduction and business problem definition\r\nKC\r\nData acquisition and preparation - cleaning & anonymisation\r\nZL\r\nLiterature Review\r\nKC\r\nExploratory Data Analysis -Time Series -Scatter Plots (total duration of entry vs waiting time)\r\nZL\r\nExploratory Data Analysis - Treemaps (container types & terminals) - Pie / Bar charts (activity counts) - Histograms (waiting time, driving time)\r\nKC\r\nConfirmatory Data Analysis - Analysis of Variance (ANOVA) - Equal / Unequal variance - Normal / Not normal distribution\r\nZL\r\nConfirmatory Data Analysis - Parallel coordinates analysis to visualise key relationships\r\nKC / ZL (Tbc)\r\nUncertainty - Median, confidence intervals via box plots / violin plots for waiting times - Error bars\r\nKC\r\nInsights and recommendations for actions\r\nKC\r\nLimitations and conclusion\r\nZL\r\nReferences\r\n1https://royalsocietypublishing.org/doi/10.1098/rsos.200386\r\n2https://seanews.co.uk/features/the-busiest-ports-in-the-world-and-how-they-handle-operations-part-ii-singapore/\r\n3https://www.globalpsa.com/psa-international/\r\n4https://www.scs.org.sg/articles/how-arti-cial-intelligence-can-make-our-port-smarter\r\n5https://www.pomsmeetings.org/confpapers/005/005-0094.doc\r\n6https://www.win.tue.nl/oowi/final%20project/archive/KoenStaats.pdf\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-25-proposal/Examples/CDA2.png",
    "last_modified": "2021-04-20T21:18:31+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Group 3",
    "description": "Welcome to our project webpage. This is created for the ISSS608 - Visual Analytics module in AY2020/21 Term 2.",
    "author": [
      {
        "name": "Lim Kai Chin",
        "url": "https://kaichinlim.netlify.app/"
      }
    ],
    "date": "2021-02-25",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-04-20T21:18:32+08:00",
    "input_file": {}
  }
]
